code25_all/perl/10103723.txt

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <createFolder xmlns="http://xyz.com/">
            <parentId xsi:type="xsd:string">1</parentId>
            <folderName xsi:type="xsd:string">Test</folderName>
        </createFolder>
    </soap:Body>
</soap:Envelope>

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xyz="http://xyz.com/">
    <soap:Body>
        <xyz:createFolder>
            <parentId xsi:type="xsd:string">1</parentId>
            <folderName xsi:type="xsd:string">Test</folderName>
        </xyz:createFolder>
    </soap:Body>
</soap:Envelope>

createFolder
